
export const reviews = [
    {
        id: 1,
        reviewerName: 'Елена Цапкова',
        tourName: 'Недельный тур по Дагестану',
        year: 2022,
        body: 'Были в июле в Дагестане . Очень понравилось. Активный тур. Посмотрели горы, водопады, плато, Аулы в которых живут местные жители и старые аулы в которых уже не живут. Познакомились изнутри с обычаями, национальными блюдами. Очень гостеприимный народ! Спасибо за отлично организованную поездку. Отдельное спасибо гиду - Самиру!',
        imgs: [
            'https://i.bolshayastrana.com/1200x00/5e/0d/5e0d7b6c81bc829597e2aa9c7b474de6.jpeg',
            'https://i.bolshayastrana.com/1200x00/cd/9d/cd9d05336f8c9bdc0e9bbe5e1529b93c.jpeg',
            'https://i.bolshayastrana.com/1200x00/64/f6/64f6ee622ed75c59068f0d328d2dd705.jpeg',
            'https://i.bolshayastrana.com/1200x00/9a/b8/9ab84ed29b0c6b05166d1ab3c0bab955.jpeg',
            'https://i.bolshayastrana.com/1200x00/2f/36/2f36b566e3be3dff41bd4f68e65b44ce.jpeg',
            'https://i.bolshayastrana.com/1200x00/cf/52/cf52f059a661f19b356938978b8036c7.jpeg'
        ],
        pfp: 'https://i.bolshayastrana.com/80x80/ce/73/ce73a2991c7eba4dde01216e094eb11a.jpeg'
    },
    {
        id: 2,
        reviewerName: 'Марина Еременко',
        tourName: 'Знакомство с Байкалом. Познавательный тур',
        year: 2022,
        body: 'Большая страна, спасибо Вам БОЛЬШОЕ за тур на Байкал! В восторге. Я и дети. Все четко, все интересно, без накладок и изменений. Каждый день насыщен экскурсиями, каждый день на новом месте, на различных видах транспорта. Уже хочется вернуться назад, на зимний Байкал. СПАСИБО Вам и нашему великолепному экскурсоводу Галине 😍😘',
        imgs: [
            'https://i.bolshayastrana.com/1200x00/99/ab/99abcd6a7657e79bebe2a1fad412c8a1.jpeg',
            'https://i.bolshayastrana.com/1200x00/1c/b0/1cb0df4b5ef0d214144e0450336792cd.jpeg',
            'https://i.bolshayastrana.com/1200x00/dd/19/dd192afa2ae3addee7ee40d0034fa476.jpeg',
            'https://i.bolshayastrana.com/1200x00/c1/34/c134d1f9cc40d945f4c70b44eed5d426.jpeg',
            'https://i.bolshayastrana.com/1200x00/fb/fd/fbfd50033e3356736ed7911402e67b08.jpeg',
        ],
        pfp: 'https://i.bolshayastrana.com/80x80/5c/b2/5cb25afafe9e36634e3c23a6088aa39e.jpeg'
    },
    {
        id: 3,
        reviewerName: 'Виктория Петрова',
        tourName: 'Верхом По Адыгее - радиальные маршруты',
        year: 2022,
        body: 'Добрый день. Выражаю благодарность команде Большой страны. Была в конном туре по Адыгее. Всё было прекрасно (только мало🤗). Получилось очень насыщенное путешествие, так как к верховым прогулкам успела добавить и экстрим парк, и рафтинг, и покупаться в источниках. Отдельно хочу отметить питание в Рябиновых бусах - просто и очень вкусно. Спасибо Ранчо Ковбой - Марине, Яне и Диме за прекрасные впечатления',
        imgs: [
            'https://i.bolshayastrana.com/1200x00/9b/a6/9ba6560458f9ce910c195e81d7f3c727.jpeg',
            'https://i.bolshayastrana.com/1200x00/00/b4/00b40d1035932e999a499579fb9c5cb0.jpeg',
            'https://i.bolshayastrana.com/1200x00/49/7b/497b0acd49382f72e080ee65ca64a571.jpeg',
            'https://i.bolshayastrana.com/1200x00/18/df/18df35f5884c6bfd9bf92f343f0e2c35.jpeg'
        ],
        pfp: 'https://i.bolshayastrana.com/80x80/be/64/be64be78148171f7a6b5bff9c64a4abf.jpeg'
    },
    {
        id: 4,
        reviewerName: 'Светлана Горбачёва',
        tourName: 'Три зимних дня за Полярном кругом',
        year: 2022,
        body: 'Хочу поблагодарить компанию «Большая страна» и лично нашего гида Василия). Тур «Три дня за Полярным кругом» получился замечательным. Всё отлично организовано: трансфер, питание, информационное содержание тура. Группа у нас тоже подобралась замечательная! Несмотря на то, что не удалось доехать до Териберки, поскольку дорога была заметена, мы отлично провели время в горах Хибины. И, конечно, мы увидели северное сияние!!! 😍😍😍',
        imgs: [
            'https://i.bolshayastrana.com/1200x00/15/81/1581cb45eb47c052279fa442876e0968.jpeg',
            'https://i.bolshayastrana.com/1200x00/c7/59/c7592233e4c5f7d2e8a457e5bfc1bbbb.jpeg',
            'https://i.bolshayastrana.com/1200x00/03/9f/039f9849dcbbae24cc1f848072afee26.jpeg'
        ],
        pfp: 'https://i.bolshayastrana.com/80x80/6d/50/6d50fc9f2691559f73e4bd30c73562d4.jpeg'
    },
    {
        id: 5,
        reviewerName: 'Екатерина Бирюкова',
        tourName: 'В Терибеку осенью и зимой',
        year: 2021,
        body: 'Всем доброго дня! Большое спасибо организаторам тура и нашим гидам! Были в Териберке на Кольском полуострове в конце октября этого года. Все очень понравилось! и теплая, уютная гостиница, и сама Териберка на краю земли, куда не каждый сам решит приехать без гида и несмотря на сложные погодные условия, мы сумели насладится красотой северной природы, куда хочется вернуться снова!',
        imgs: [
            'https://i.bolshayastrana.com/1200x00/53/d7/53d711a298a3b5bc352b87fe26bacdfa.jpeg',
            'https://i.bolshayastrana.com/1200x00/8a/14/8a1405b58cc4d58868be4bbbef953316.jpeg',
            'https://i.bolshayastrana.com/1200x00/37/f3/37f36d6aac532d277ba77901ceec7baf.jpeg'
        ],
        pfp: 'https://i.bolshayastrana.com/80x80/8e/ff/8eff2962217a639ad9c14094a08e7dee.jpeg'
    },
    {
        id: 6,
        reviewerName: 'Анна Янчукова',
        tourName: 'Дивные места Карелии',
        year: 2018,
        body: 'Была в туре «Дивные места Карелии». Мое путешествие заняло три дня. Я получила просто уйму позитивных эмоций. Очень благодарна своему менеджеру Алине и гиду Анне. Девочки очень оперативные. Тур интересный и насыщенный. Анна радовала историями и легендами на протяжении всего пути. Надеюсь,смогу вырваться еще на зимние праздники. Ведь, Карелия - это тот край, который встретит тебя с распростертыми руками и улыбкой.',
        imgs: [
            'https://i.bolshayastrana.com/1200x00/87/d0/87d0915700b9186cca12b2683922f8cd.jpeg',
            'https://i.bolshayastrana.com/1200x00/10/00/100002.jpg',
            'https://i.bolshayastrana.com/1200x00/10/00/100003.jpg',
            'https://i.bolshayastrana.com/1200x00/10/00/100004.jpg'
        ],
        pfp: 'https://i.bolshayastrana.com/80x80/10/00/100001.jpg'
    }
]